Tekla Open API Reference for Tekla Structures 2025
Distance.Parse Method
Overload List
Name | Description
Parse(String)
 Parses a distance from a string representation using the current unit type and culture.
Parse(String, IFormatProvider)
 Parses a distance from a string representation using the current unit type and the given culture.
Parse(String, IFormatProvider, Distance.UnitType)
 Parses a distance from a string representation using the given unit type and culture.
Top
See Also
Reference
Distance Structure
Tekla.Structures.Datatype Namespace